python_curriculum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-14 Mon 11:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An Intro to Python for Finance</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">An Intro to Python for Finance</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1f5e3b">1. Week 1 (Setup)</a>
<ul>
<li><a href="#orgeb59921">1.1. Session 1</a></li>
<li><a href="#org75beaa8">1.2. Session 2</a></li>
<li><a href="#org6cc6c7b">1.3. Session 3</a></li>
</ul>
</li>
<li><a href="#orgbd567e0">2. Week 2 (Pandas and Data Description)</a>
<ul>
<li><a href="#orgf0d0a4e">2.1. Session 1</a>
<ul>
<li><a href="#orgd455673">2.1.1. Exercise: Is there a correlation between industry institutional ownership and return on equity?</a></li>
</ul>
</li>
<li><a href="#org285e15e">2.2. Session 2</a>
<ul>
<li><a href="#orga8356dc">2.2.1. Exercise: PPP Loan Statistics by State</a></li>
<li><a href="#org29ab60d">2.2.2. Alternative: What is the average price at which a power plant sells electricity?</a></li>
<li><a href="#org7d4d26e">2.2.3. Alternative: What is the average on and off-peak real-time fuel mix?</a></li>
</ul>
</li>
<li><a href="#orged6523c">2.3. Session 3</a>
<ul>
<li><a href="#org7f84ccb">2.3.1. Exercise: What is the NPV of a Power Plant over a Year?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org31f034e">3. Week 3 (Numpy/Scipy and APIs)</a>
<ul>
<li><a href="#orge93aba5">3.1. Session 1</a>
<ul>
<li><a href="#org1b7a893">3.1.1. Exercise: Pull stock data via API and estimate a Markowitz mean-variance optimal portfolio.</a></li>
<li><a href="#org924b842">3.1.2. Alternative: Calculate futures prices given options (but we cant get this from API data).</a></li>
</ul>
</li>
<li><a href="#org6aa1885">3.2. Session 2</a>
<ul>
<li><a href="#org0d57670">3.2.1. Exercise: Calculate market depth via Kyle's lambda. Use Coinbase API to get trades.</a></li>
</ul>
</li>
<li><a href="#org6fa75ff">3.3. Session 3</a>
<ul>
<li><a href="#org21fed9d">3.3.1. Exercise: Deposit insurance valuation using (Merton's) option pricing method. (chapter 19, Merton's CTF)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1828688">4. Week 4</a>
<ul>
<li><a href="#orgb9c6e82">4.1. Session 1</a></li>
<li><a href="#org5791281">4.2. Session 2</a></li>
<li><a href="#orgab78902">4.3. Session 3</a></li>
</ul>
</li>
<li><a href="#orgdc57237">5. Bonus Project: The Pairs Trade</a></li>
</ul>
</div>
</div>
<p>
Note most other courses use stock data and create trading algorithms.  Here we are going to focus on core financial analyst tasks, e.g. what is the average PPP loan size in Texas? These questions are increasingly being answered in Python rather than Excel.
</p>

<p>
We can provide exercises at the end of each session.  The students can complete these in a Jupyter notebook, and we can provide solutions.  Do we want to attempt to grade them?
</p>

<div id="outline-container-orge1f5e3b" class="outline-2">
<h2 id="orge1f5e3b"><span class="section-number-2">1</span> Week 1 (Setup)</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeb59921" class="outline-3">
<h3 id="orgeb59921"><span class="section-number-3">1.1</span> Session 1</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Course Overview:  
<ul class="org-ul">
<li>What we will cover in the course.</li>
<li>The use of Python in finance.</li>
</ul></li>

<li>Python Relative to other tools.
<ul class="org-ul">
<li>Excel</li>
<li>Other Programming Languages</li>
<li>Comparison with R</li>
<li>Using Javascript for Visualization</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org75beaa8" class="outline-3">
<h3 id="org75beaa8"><span class="section-number-3">1.2</span> Session 2</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Interacting with Python
<ul class="org-ul">
<li>Google's Colab and Jupyter
<ul class="org-ul">
<li>Introduction to markdown</li>
<li>Installing and loading packages.</li>
<li>Sharing notebooks</li>
</ul></li>
<li>You are on a Linux Server</li>
<li><b><b>Creating Functions and Time-Value-of-Money calculations</b></b>.</li>
</ul></li>
<li>Python Classes and Object Orientation
<ul class="org-ul">
<li>What is a Class</li>
<li>Function vs Method:  methods are functions attached to a class</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org6cc6c7b" class="outline-3">
<h3 id="org6cc6c7b"><span class="section-number-3">1.3</span> Session 3</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The Python ecosystem.
</p>

<ul class="org-ul">
<li>An Introduction to Useful Packages:
<ul class="org-ul">
<li><a href="https://pandas.pydata.org/">Pandas</a></li>
<li><a href="https://numpy.org/">Numpy</a></li>
<li>Scipy and Scikit Learn</li>
<li>Pytorch</li>
<li>Tensorflow and Keras</li>
</ul></li>

<li>Finding Packages
<ul class="org-ul">
<li>pip</li>
</ul></li>

<li>Python Packages
<ul class="org-ul">
<li>Extending the core language</li>
<li>Our most used packages.</li>
<li><del>Installing and Loading.</del> ^ already in session 2</li>
<li>How to call methods/functions from a package.</li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgbd567e0" class="outline-2">
<h2 id="orgbd567e0"><span class="section-number-2">2</span> Week 2 (Pandas and Data Description)</h2>
<div class="outline-text-2" id="text-2">
<p>
Get spreadsheet type data and perform a corporate finance related task.
</p>
</div>


<div id="outline-container-orgf0d0a4e" class="outline-3">
<h3 id="orgf0d0a4e"><span class="section-number-3">2.1</span> Session 1</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://colab.research.google.com/drive/1KLqsQWbXHYSruQXBAJ1QamsxV9FLDN_R">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>An intro to Pandas</li>
<li>Reading csv and excel files.
<ul class="org-ul">
<li>Locally and over the web.</li>
</ul></li>
<li>Inspecting the objects</li>
<li>Determining dataframe size and the column types.</li>
<li>Adding new columns</li>
</ul>
</div>

<div id="outline-container-orgd455673" class="outline-4">
<h4 id="orgd455673"><span class="section-number-4">2.1.1</span> Exercise: Is there a correlation between industry institutional ownership and return on equity?</h4>
</div>
</div>

<div id="outline-container-org285e15e" class="outline-3">
<h3 id="org285e15e"><span class="section-number-3">2.2</span> Session 2</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="https://colab.research.google.com/drive/16UVjO2PEQUN5b1JoI__JYfj7K_aMuom7#scrollTo=nBbjWR1JYksh">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>Interacting with the OS.</li>
<li>Append/Concat.</li>
</ul>


<ul class="org-ul">
<li>Summary Statistics</li>
<li>Subsetting data</li>
<li>Pivot Tables</li>
</ul>
</div>

<div id="outline-container-orga8356dc" class="outline-4">
<h4 id="orga8356dc"><span class="section-number-4">2.2.1</span> Exercise: PPP Loan Statistics by State</h4>
</div>
<div id="outline-container-org29ab60d" class="outline-4">
<h4 id="org29ab60d"><span class="section-number-4">2.2.2</span> Alternative: What is the average price at which a power plant sells electricity?</h4>
</div>
<div id="outline-container-org7d4d26e" class="outline-4">
<h4 id="org7d4d26e"><span class="section-number-4">2.2.3</span> Alternative: What is the average on and off-peak real-time fuel mix?</h4>
</div>
</div>

<div id="outline-container-orged6523c" class="outline-3">
<h3 id="orged6523c"><span class="section-number-3">2.3</span> Session 3</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Creating our own functions.</li>
<li>Time value of money calculations.</li>
<li>Should we go with the full set of steps to create the PPP data set?</li>
</ul>

<p>
Connecting to databases here?
</p>
</div>

<div id="outline-container-org7f84ccb" class="outline-4">
<h4 id="org7f84ccb"><span class="section-number-4">2.3.1</span> Exercise: What is the NPV of a Power Plant over a Year?</h4>
</div>
</div>
</div>



<div id="outline-container-org31f034e" class="outline-2">
<h2 id="org31f034e"><span class="section-number-2">3</span> Week 3 (Numpy/Scipy and APIs)</h2>
<div class="outline-text-2" id="text-3">
<p>
Get data from APIs and use for a somewhat more investments focused exercise.
</p>
</div>

<div id="outline-container-orge93aba5" class="outline-3">
<h3 id="orge93aba5"><span class="section-number-3">3.1</span> Session 1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="https://colab.research.google.com/drive/16h1ykVWbb5fL-xRgOrYmYe9SqfrSin1x#scrollTo=4cmbxkCjM1fH">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>An introduction to Application Programming Interfaces (APIs) and online
data
<ul class="org-ul">
<li>Example: Coinbase API</li>
<li>Example: Interactive Brokers API</li>
<li>EIA API.</li>
</ul></li>
<li>Connecting to databases.</li>
</ul>
</div>

<div id="outline-container-org1b7a893" class="outline-4">
<h4 id="org1b7a893"><span class="section-number-4">3.1.1</span> Exercise: Pull stock data via API and estimate a Markowitz mean-variance optimal portfolio.</h4>
</div>
<div id="outline-container-org924b842" class="outline-4">
<h4 id="org924b842"><span class="section-number-4">3.1.2</span> Alternative: Calculate futures prices given options (but we cant get this from API data).</h4>
</div>
</div>

<div id="outline-container-org6aa1885" class="outline-3">
<h3 id="org6aa1885"><span class="section-number-3">3.2</span> Session 2</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<a href="https://colab.research.google.com/drive/1GGXpVBhSIypRslVcjWB5TYcexeRxZlyY">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>An overview of scipy and basic statistics in Python.
<ul class="org-ul">
<li>Extracting coefficients from an estimated regression model.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org0d57670" class="outline-4">
<h4 id="org0d57670"><span class="section-number-4">3.2.1</span> Exercise: Calculate market depth via Kyle's lambda. Use Coinbase API to get trades.</h4>
<div class="outline-text-4" id="text-3-2-1">
</div>
</div>
</div>

<div id="outline-container-org6fa75ff" class="outline-3">
<h3 id="org6fa75ff"><span class="section-number-3">3.3</span> Session 3</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<a href="https://colab.research.google.com/drive/1u4BUOasPaIVfe8-rD73QXlXmt5EMIMxK">Colab Notebook</a>
</p>
</div>

<div id="outline-container-org21fed9d" class="outline-4">
<h4 id="org21fed9d"><span class="section-number-4">3.3.1</span> Exercise: Deposit insurance valuation using (Merton's) option pricing method. (chapter 19, Merton's CTF)</h4>
</div>
</div>
</div>

<div id="outline-container-org1828688" class="outline-2">
<h2 id="org1828688"><span class="section-number-2">4</span> Week 4</h2>
<div class="outline-text-2" id="text-4">
<p>
Where to go from here.  How to share code, get help, and create reproducible
environments.
</p>
</div>

<div id="outline-container-orgb9c6e82" class="outline-3">
<h3 id="orgb9c6e82"><span class="section-number-3">4.1</span> Session 1</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://colab.research.google.com/drive/1CQ00H_duTY2lhiwzJ041JTPD6BGBdk5y#scrollTo=Z5RfT4TNucfe">Colab Notebook</a>
</p>

<ul class="org-ul">
<li>Visualization:
<ul class="org-ul">
<li>Matplotlib</li>
<li>Seaborn</li>
<li>Plotly</li>
<li>ggplot (using plotnine library)</li>
</ul></li>
<li>Interactive Web Apps via Plotly's Dash</li>
</ul>
</div>
</div>

<div id="outline-container-org5791281" class="outline-3">
<h3 id="org5791281"><span class="section-number-3">4.2</span> Session 2</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>The Integrated Development Environment (IDE)
<ul class="org-ul">
<li>What does an IDE provide?
<ul class="org-ul">
<li>Code Completion</li>
<li>Linter</li>
</ul></li>
<li>Git/Github and IDE Integration</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgab78902" class="outline-3">
<h3 id="orgab78902"><span class="section-number-3">4.3</span> Session 3</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>Git/Github and IDE Integration
<ul class="org-ul">
<li>Why use version control?
<ul class="org-ul">
<li>Collaborate with others more easily.</li>
<li>Show others your work.</li>
</ul></li>
</ul></li>

<li><a href="https://colab.research.google.com/github/googlecolab/colabtools/blob/master/notebooks/colab-github-demo.ipynb">Github from Colab</a></li>

<li>Virtual Environments
<ul class="org-ul">
<li>Ensuring compatible python and package versions.</li>
<li>Anaconda Python</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdc57237" class="outline-2">
<h2 id="orgdc57237"><span class="section-number-2">5</span> Bonus Project: The Pairs Trade</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-12-14 Mon 11:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
